{
  "27393337": {
    "body": "Buddy of mine works at a husqvarna dealer. He told me back in July that there were plans on a 701 Adventure. I've been trollin looking for more info on here. Patiently waiting..",
    "id": 27393337,
    "is_liked": true,
    "quotes": []
  },
  "28084769": {
    "body": "I am really interested if the Huskvarna actually has less vibration in the handlebars.",
    "id": 28084769,
    "is_liked": true,
    "quotes": []
  },
  "27390750": {
    "body": "No pics, it didn't happen! :)",
    "id": 27390750,
    "is_liked": true,
    "quotes": []
  },
  "28088463": {
    "body": "It's actually because you don't notice vibration on dirt like you would on pavement.",
    "id": 28088463,
    "is_liked": false,
    "quotes": [
      28086247
    ]
  },
  "28084678": {
    "body": "... it's time that someone makes a detailed test drive and tell us whether 701 feels like 690.",
    "id": 28084678,
    "is_liked": true,
    "quotes": []
  },
  "28082746": {
    "body": "Exhaust pipe looks identical to my untrained eye, but even if it is different, there is no such thing as a stock KTM exhaust that doesn't cook you. I think it's funny to read the writers reviews about it, like its the first of its class. Sent from my iPhone using Tapatalk",
    "id": 28082746,
    "is_liked": false,
    "quotes": []
  },
  "28084806": {
    "body": "Well fuck thats enough internet for me today. Dragos is making sense. I'm off to bed.",
    "id": 28084806,
    "is_liked": true,
    "quotes": [
      28084764
    ]
  },
  "28093125": {
    "body": "Some interesting stuff!",
    "id": 28093125,
    "is_liked": false,
    "quotes": []
  },
  "27401154": {
    "body": "Top right.... And here is your pic from the other side..",
    "id": 27401154,
    "is_liked": false,
    "quotes": [
      27401120
    ]
  },
  "27399832": {
    "body": "That's the new Twin, right? Awesome!",
    "id": 27399832,
    "is_liked": false,
    "quotes": [
      27390699
    ]
  },
  "28084899": {
    "body": "I wonder what all the naysayers will have to say if in 2017, 690 enduro will disappear and the 701 will get the new Duke 2016 amazing engine, or if both 701 and 690 will get that power plant and the 690 will get the 701 new frame. On the second scenario, that means KTM will be Husky, because will share it's frame? I also don't get all this negativity towards KTM, in the end. Both KTM and Husky are part of the same group. An even better example than the Lexus/Toyota would be the VW Group. If Audi A4 for example, Passat and Octavia are the same cars in someone's mind then yes 690=701. IMHO they are not, although they have plenty more common parts than 701 has with 690 keeping the proportions. More details on that new engine and some pretty fine details about possible frame clearance and compatibility only with the 701 in this post: http://advrider.com/index.php?threads/ktm-690-adventure-re-build.1016239/page-25#post-28066219",
    "id": 28084899,
    "is_liked": true,
    "quotes": []
  },
  "27392807": {
    "body": "I was talking about the EXC/FE bikes.",
    "id": 27392807,
    "is_liked": false,
    "quotes": []
  },
  "28054241": {
    "body": "Thanx!",
    "id": 28054241,
    "is_liked": false,
    "quotes": []
  },
  "27402749": {
    "body": "Looks like the enduro version has real WP forks on it. Might be just for testing though. What they need to do, is finally fix the rocker issue.",
    "id": 27402749,
    "is_liked": false,
    "quotes": []
  },
  "27391286": {
    "body": "Can't wait! The 701 sumo looks awesome.",
    "id": 27391286,
    "is_liked": false,
    "quotes": []
  },
  "27403022": {
    "body": "Yeah but then they'll create a new issue that we don't know about and have to learn the hard way. I kinda like knowing where to look especially close during each maintenance.",
    "id": 27403022,
    "is_liked": false,
    "quotes": []
  },
  "27401669": {
    "body": "Can you tell us what the actual color is? Most photos online show it being Hi-Viz yellow, but some photos I've seen show it more as the normal Husky yellow. Which is it ? Is the Enduro model the same color scheme or different in some way? Thanks !!!",
    "id": 27401669,
    "is_liked": false,
    "quotes": [
      27390699
    ]
  },
  "28055517": {
    "body": "Probably better than the UK press, most of which have never ridden off road and give such bikes poor reviews.",
    "id": 28055517,
    "is_liked": false,
    "quotes": []
  },
  "27403252": {
    "body": "I assume the Husqvarna idea is simply to duplicate the success of KTM at a higher price point with a different story to tell. They might not get us (the adv nerds), but there are 8 billion others. Maybe in 2019 it will become hip for investment bankers to cycle on a e-Husky through Manhattan. If it does not work out, KTM has spend - beside marketing dollars - the lowest possible amount due to plain 1:1 product copies. If it works, they can start to setup a more differentiated product line ... or even not.",
    "id": 27403252,
    "is_liked": false,
    "quotes": []
  },
  "28056299": {
    "body": "I believe the Dirt Bike magazine editor means the total quantity of fuel the bike will hold with the extra tanks.",
    "id": 28056299,
    "is_liked": true,
    "quotes": []
  },
  "28085896": {
    "body": "Was looking at Husky's at MotoForza the other day. They seemed extra sanitary, very clean... it was attractive.",
    "id": 28085896,
    "is_liked": false,
    "quotes": []
  },
  "28088727": {
    "body": "The first 701 is in at my local dealer ! Checking it out this thursday. (it's the supermoto though)",
    "id": 28088727,
    "is_liked": false,
    "quotes": []
  },
  "27391761": {
    "body": "Rubbish - tiny tiny differences - same bike For this to be anything worth celebrating, Husky will need to have addressed some of the 690R's fundamental design flaws - short gearbox / ratshit suspension / etc",
    "id": 27391761,
    "is_liked": true,
    "quotes": [
      27391296
    ]
  },
  "27391296": {
    "body": "There are a number of differences between the KTM 350/500 EXC & the Husqvarna FE 350/501. They aren't \"white\" KTM's. Based on sure, but not badge engineered carbon copies.",
    "id": 27391296,
    "is_liked": false,
    "quotes": []
  },
  "28053511": {
    "body": "Delivery in the Netherlands is not before the new year",
    "id": 28053511,
    "is_liked": false,
    "quotes": []
  },
  "28056481": {
    "body": "Maybe I should start saving for the 701 Rally below :)",
    "id": 28056481,
    "is_liked": true,
    "quotes": []
  },
  "28087789": {
    "body": "Probably because adv types won't bitch too much about the vibes as much as a newby rider getting on a Duke might.",
    "id": 28087789,
    "is_liked": false,
    "quotes": [
      28086247
    ]
  },
  "28089007": {
    "body": "We will of course expect a full report [emoji6]",
    "id": 28089007,
    "is_liked": true,
    "quotes": [
      28088727
    ]
  },
  "28057445": {
    "body": "photoshopped",
    "id": 28057445,
    "is_liked": false,
    "quotes": [
      28056481
    ]
  },
  "28054508": {
    "body": "Now thats a start!!",
    "id": 28054508,
    "is_liked": false,
    "quotes": [
      28051189
    ]
  },
  "27391579": {
    "body": "I don't care what color it is as long as it means we get more! We cannot get enough 690 Enduros as it sits so if this gives us more to sell then I don't care even if it is identical! Unfortunately for the all of 30 seconds they let us see it, tough to tell the differences but definitely carried the Husky look.",
    "id": 27391579,
    "is_liked": false,
    "quotes": [
      27391169
    ]
  },
  "27403685": {
    "body": "Yeah, BUT the 7 billion others are more interested in the latest I phone and talking absolute nonsense in facebook... IT IS us ADV riders that IS their target audience. This Husky thing is PURELY MARKETING. (one of the oldest and legandary MC brands out there) It is funny/AND telling, how fast they have buried the Husaberg brand... Which has put the actual HUSKY engineers jobless... BUT if they finally bring out the 690 ADV, i can forgive them, maybe... And fix the self imploding rockers will YA KTM! I mean the engine is only 9 years old...",
    "id": 27403685,
    "is_liked": true,
    "quotes": [
      27403252
    ]
  },
  "28095344": {
    "body": "They are the same bike. Those who point out that the screws are different or that the colors are different - continue on. If I were in the market for a new 500, I would take the KTM XCW over the Husky 501 because of the PDS rear suspension. If I didn't care about the PDS suspension I would take the Husky 501 over KTM as the Husky has a lot more \"trick\" parts on it vice the KTM. That being said, they are still the same bike. There are not enough differences between the two...yet. Now THIS is what I would call a \"different bike\". LOL! Husqvarna takes to the streets with Vitpilen 701 concept http://www.gizmag.com/husqvarna-701-vitpilen-concept/40560/",
    "id": 28095344,
    "is_liked": false,
    "quotes": []
  },
  "28050856": {
    "body": "You're right!",
    "id": 28050856,
    "is_liked": false,
    "quotes": [
      28043130
    ]
  },
  "28083151": {
    "body": "Oh, Husaberg hardly developed the engine from scratch. When I cooked the rocker arms in my FE570 I replaced them with 500 EXC rocker arms because they are the same but with an extra groove for oil, same as the KTM 450/530. http://advrider.com/index.php?threads/08-11-ktm-450-530-rocker-shaft-upgrade.949976/ Actually the VIN sticker on my 570 says KTM so I am not clear on what their relationship was.",
    "id": 28083151,
    "is_liked": false,
    "quotes": [
      28082770
    ]
  },
  "28057049": {
    "body": "That would explain those welded bosses on the head tube... build that thing and take my money.",
    "id": 28057049,
    "is_liked": false,
    "quotes": []
  },
  "28053792": {
    "body": "Shit, since I'm a dutchie myself and about to order one... Anyway, which dealer did you ask?",
    "id": 28053792,
    "is_liked": false,
    "quotes": [
      28053511
    ]
  },
  "28051189": {
    "body": "",
    "id": 28051189,
    "is_liked": true,
    "quotes": [
      28050567
    ]
  },
  "27390699": {
    "body": "So just back from the 2016 Husqvarna Dealer meeting and we got a glimpse of the 2016 Husqvarna 701 Super Moto that we knew was coming but they also rolled out the new 2016 Husqvarna 701 Enduro. We are not allowed to take pics but we all saw it! Alright....go!",
    "id": 27390699,
    "is_liked": true,
    "quotes": []
  },
  "27399231": {
    "body": "I must admit I am lurking the Husky sites looking for specifications on the 2016 models. Interested to see just what the differences are between the KTM and Husky versions",
    "id": 27399231,
    "is_liked": true,
    "quotes": []
  },
  "28057326": {
    "body": "Read the fine print",
    "id": 28057326,
    "is_liked": true,
    "quotes": []
  },
  "28082770": {
    "body": "There is some truth to that. SP bought Husky for the brand and all the history and image that goes with it. If you follow the industry much you know that he has been working at developing a two tiered strategy for some time. Husaberg never really caught on because few knew what they were and the dealership network never developed. Further, with the 70 degree engine in the Husaberg and \"normal\" engines in KTMs there was no cost sharing between brands. SP talked about the VW model when purchasing Husky. Same basic platform across Seat, VW, Audi, and Porsche to a lesser degree but different price points, buyer, and marketing.",
    "id": 28082770,
    "is_liked": false,
    "quotes": [
      28082453
    ]
  },
  "28086226": {
    "body": "Even if that is the case, that is good. For me a major factor is my favorite dealer now has a bike that fits my needs. Some folks like GMC pickups better than Chevy. But they are basically the same. Choice is good. And in the case of making Husky a respected name again this is most definitely a positive development. I have owned 4 different 690's and have my name down on a 701. I like what I am hearing about the differences between the two models.",
    "id": 28086226,
    "is_liked": false,
    "quotes": [
      28086153
    ]
  },
  "28057276": {
    "body": "Wow. Me too. Can't wait to hear more about it. Sent from my iPhone using Tapatalk",
    "id": 28057276,
    "is_liked": false,
    "quotes": [
      28056481
    ]
  },
  "28054929": {
    "body": "Keep an eye on the Dutch motorcycle press and online reports - I was chatting to a couple of Dutch journalists and they rode both the Enduro and SM models recently and were full of praise for them. Reports should be out soon ..............",
    "id": 28054929,
    "is_liked": true,
    "quotes": [
      28053511
    ]
  },
  "28084211": {
    "body": "Husky's, Husabergs and KTM's may share most of the same component parts, but subtle changes can make a huge difference. These two gentlemen share over 99.8% of the same DNA and yet one of them had perhaps the worlds greatest mind. The other has fluff stuck to his head because it's made of toffee",
    "id": 28084211,
    "is_liked": true,
    "quotes": []
  },
  "28084764": {
    "body": "Absolutely no one mentioned \"all new\". It's a different bike, on a well known platform. Frame is different. Suspension is different. Tank & subframe are different. Seat is different. Dash is different. Accessories are different.",
    "id": 28084764,
    "is_liked": true,
    "quotes": [
      28082453
    ]
  },
  "28086247": {
    "body": "Anybody know why the Duke got the engine upgrades before the 690 and not the other way around?",
    "id": 28086247,
    "is_liked": false,
    "quotes": [
      28084899
    ]
  },
  "28052621": {
    "body": "More should follow this evening - been catching up with the real world (aka 'work' !) today ......",
    "id": 28052621,
    "is_liked": false,
    "quotes": [
      28050567
    ]
  },
  "28084220": {
    "body": "Your opinion on which head is made from toffee depends on what you want out of life...same as the KTM - Husky debate. Whether you are considering the above picture or debating about KTM-Husky, the same rule applies - you should seriously consider other options before choosing Orange",
    "id": 28084220,
    "is_liked": true,
    "quotes": []
  },
  "27390764": {
    "body": "They have a worldwide press \"embargo\" on that unit until I believe October, we are told to expect them in the dealership in Feb. 2016.",
    "id": 27390764,
    "is_liked": false,
    "quotes": []
  },
  "27401955": {
    "body": "I'm certainly no tycoon and don't play one on the internet, but I just don't get the business logic of KTM moving established KTM models to the Husqvarna brand. Assuming the 701 is, for all practical purposes, the 690 Enduro, and the KTM version is to be discontinued, then my preferred dealer (and the only KTM dealer in my area) will simply not carry them, despite the 690 having probably been his most successfully-selling among all street-legal KTMs. I'm sure he's still not going to set up an additional separate Husky dealership just to continue selling the 701. I can understand, for example, Honda's requiring separate dealerships for its motorcycles and its power products or watercraft. But the whole KTM/Husky thing is, in my mind, more akin to Yamaha/Star or Kawasaki/Vulcan or Suzuki/Boulevard, at least from the potential buyer's perspective. I mean, it looks like KTM wants to eventually brand its off-road race bikes KTM, and its non-competition bikes Husky, just to keep a marquee alive (or merely resurrected). In the US market, it seems to me to just confuse the customer; always an impediment to sales. I'm not a dealer and no one has told me this directly, but I've come to suspect from reading between the lines that a KTM dealer can't just order n bikes of a particular model he that he knows he can sell in his market area; he has to select multi-model \"packages\" which offer minimal flexibility. He ends up with a glut of expensive models for which there just isn't any interest in his primary market (his area of expertise, not KTM's). Maybe all brands have similar requirements to some measure, but if so, I suspect to a much less restrictive degree. I wonder if that's not part of the evidently wide-spread \"shortage\" of available 690 Enduros. JET",
    "id": 27401955,
    "is_liked": true,
    "quotes": []
  },
  "28056130": {
    "body": "Dirt Bike magazine is reporting that those front tanks will bring another 5.5 US gallons http://dirtbikemagazine.com/industry-news/eichma-worlds-largest-motorcycle-show-day-1",
    "id": 28056130,
    "is_liked": false,
    "quotes": []
  },
  "28054226": {
    "body": "Mellendijk Motor Parts.",
    "id": 28054226,
    "is_liked": false,
    "quotes": [
      28053792
    ]
  },
  "28050567": {
    "body": "Keep the pics coming! Got more from the exhaust side?",
    "id": 28050567,
    "is_liked": false,
    "quotes": [
      28047861
    ]
  },
  "28086153": {
    "body": "Never said & never meant to imply the new bikes are not great, just saying they took a respected & honored marque from the 60's, 70's & into the 80's & with a few changes to their bike call them Husky's.",
    "id": 28086153,
    "is_liked": false,
    "quotes": []
  },
  "27401120": {
    "body": "Enduro version in the background?",
    "id": 27401120,
    "is_liked": true,
    "quotes": []
  },
  "28054505": {
    "body": "I can wait a little and see how that front tank works out :)",
    "id": 28054505,
    "is_liked": false,
    "quotes": []
  },
  "28056334": {
    "body": "If that's the case it's not written very clearly, but I see your point. Tough to tell from the picture.",
    "id": 28056334,
    "is_liked": false,
    "quotes": [
      28056299
    ]
  },
  "27391169": {
    "body": "Based on the sumo, I wouldn't expect anything other than a KTM 690 Enduro with different badges on it.",
    "id": 27391169,
    "is_liked": false,
    "quotes": []
  }
}
