{
  "28054505": {
    "body": "I can wait a little and see how that front tank works out :)",
    "id": 28054505,
    "is_liked": false,
    "quotes": []
  },
  "28057445": {
    "body": "photoshopped",
    "id": 28057445,
    "is_liked": false,
    "quotes": [
      28056481
    ]
  },
  "28086153": {
    "body": "Never said & never meant to imply the new bikes are not great, just saying they took a respected & honored marque from the 60's, 70's & into the 80's & with a few changes to their bike call them Husky's.",
    "id": 28086153,
    "is_liked": false,
    "quotes": []
  },
  "28050856": {
    "body": "You're right!",
    "id": 28050856,
    "is_liked": false,
    "quotes": [
      28043130
    ]
  },
  "28057326": {
    "body": "Read the fine print",
    "id": 28057326,
    "is_liked": true,
    "quotes": []
  },
  "28088463": {
    "body": "It's actually because you don't notice vibration on dirt like you would on pavement.",
    "id": 28088463,
    "is_liked": false,
    "quotes": [
      28086247
    ]
  },
  "28054508": {
    "body": "Now thats a start!!",
    "id": 28054508,
    "is_liked": false,
    "quotes": [
      28051189
    ]
  },
  "28083151": {
    "body": "Oh, Husaberg hardly developed the engine from scratch. When I cooked the rocker arms in my FE570 I replaced them with 500 EXC rocker arms because they are the same but with an extra groove for oil, same as the KTM 450/530. http://advrider.com/index.php?threads/08-11-ktm-450-530-rocker-shaft-upgrade.949976/ Actually the VIN sticker on my 570 says KTM so I am not clear on what their relationship was.",
    "id": 28083151,
    "is_liked": false,
    "quotes": [
      28082770
    ]
  },
  "28086226": {
    "body": "Even if that is the case, that is good. For me a major factor is my favorite dealer now has a bike that fits my needs. Some folks like GMC pickups better than Chevy. But they are basically the same. Choice is good. And in the case of making Husky a respected name again this is most definitely a positive development. I have owned 4 different 690's and have my name down on a 701. I like what I am hearing about the differences between the two models.",
    "id": 28086226,
    "is_liked": false,
    "quotes": [
      28086153
    ]
  },
  "28082770": {
    "body": "There is some truth to that. SP bought Husky for the brand and all the history and image that goes with it. If you follow the industry much you know that he has been working at developing a two tiered strategy for some time. Husaberg never really caught on because few knew what they were and the dealership network never developed. Further, with the 70 degree engine in the Husaberg and \"normal\" engines in KTMs there was no cost sharing between brands. SP talked about the VW model when purchasing Husky. Same basic platform across Seat, VW, Audi, and Porsche to a lesser degree but different price points, buyer, and marketing.",
    "id": 28082770,
    "is_liked": false,
    "quotes": [
      28082453
    ]
  },
  "28050567": {
    "body": "Keep the pics coming! Got more from the exhaust side?",
    "id": 28050567,
    "is_liked": false,
    "quotes": [
      28047861
    ]
  },
  "28089007": {
    "body": "We will of course expect a full report [emoji6]",
    "id": 28089007,
    "is_liked": true,
    "quotes": [
      28088727
    ]
  },
  "28084220": {
    "body": "Your opinion on which head is made from toffee depends on what you want out of life...same as the KTM - Husky debate. Whether you are considering the above picture or debating about KTM-Husky, the same rule applies - you should seriously consider other options before choosing Orange",
    "id": 28084220,
    "is_liked": true,
    "quotes": []
  },
  "28051189": {
    "body": "",
    "id": 28051189,
    "is_liked": true,
    "quotes": [
      28050567
    ]
  },
  "28056334": {
    "body": "If that's the case it's not written very clearly, but I see your point. Tough to tell from the picture.",
    "id": 28056334,
    "is_liked": false,
    "quotes": [
      28056299
    ]
  },
  "28086247": {
    "body": "Anybody know why the Duke got the engine upgrades before the 690 and not the other way around?",
    "id": 28086247,
    "is_liked": false,
    "quotes": [
      28084899
    ]
  },
  "28084769": {
    "body": "I am really interested if the Huskvarna actually has less vibration in the handlebars.",
    "id": 28084769,
    "is_liked": true,
    "quotes": []
  },
  "28056130": {
    "body": "Dirt Bike magazine is reporting that those front tanks will bring another 5.5 US gallons http://dirtbikemagazine.com/industry-news/eichma-worlds-largest-motorcycle-show-day-1",
    "id": 28056130,
    "is_liked": false,
    "quotes": []
  },
  "28085896": {
    "body": "Was looking at Husky's at MotoForza the other day. They seemed extra sanitary, very clean... it was attractive.",
    "id": 28085896,
    "is_liked": false,
    "quotes": []
  },
  "28087789": {
    "body": "Probably because adv types won't bitch too much about the vibes as much as a newby rider getting on a Duke might.",
    "id": 28087789,
    "is_liked": false,
    "quotes": [
      28086247
    ]
  },
  "28095344": {
    "body": "They are the same bike. Those who point out that the screws are different or that the colors are different - continue on. If I were in the market for a new 500, I would take the KTM XCW over the Husky 501 because of the PDS rear suspension. If I didn't care about the PDS suspension I would take the Husky 501 over KTM as the Husky has a lot more \"trick\" parts on it vice the KTM. That being said, they are still the same bike. There are not enough differences between the two...yet. Now THIS is what I would call a \"different bike\". LOL! Husqvarna takes to the streets with Vitpilen 701 concept http://www.gizmag.com/husqvarna-701-vitpilen-concept/40560/",
    "id": 28095344,
    "is_liked": false,
    "quotes": []
  },
  "28082746": {
    "body": "Exhaust pipe looks identical to my untrained eye, but even if it is different, there is no such thing as a stock KTM exhaust that doesn't cook you. I think it's funny to read the writers reviews about it, like its the first of its class. Sent from my iPhone using Tapatalk",
    "id": 28082746,
    "is_liked": false,
    "quotes": []
  },
  "28084764": {
    "body": "Absolutely no one mentioned \"all new\". It's a different bike, on a well known platform. Frame is different. Suspension is different. Tank & subframe are different. Seat is different. Dash is different. Accessories are different.",
    "id": 28084764,
    "is_liked": true,
    "quotes": [
      28082453
    ]
  },
  "28053792": {
    "body": "Shit, since I'm a dutchie myself and about to order one... Anyway, which dealer did you ask?",
    "id": 28053792,
    "is_liked": false,
    "quotes": [
      28053511
    ]
  },
  "28084806": {
    "body": "Well fuck thats enough internet for me today. Dragos is making sense. I'm off to bed.",
    "id": 28084806,
    "is_liked": true,
    "quotes": [
      28084764
    ]
  },
  "28053511": {
    "body": "Delivery in the Netherlands is not before the new year",
    "id": 28053511,
    "is_liked": false,
    "quotes": []
  },
  "28056481": {
    "body": "Maybe I should start saving for the 701 Rally below :)",
    "id": 28056481,
    "is_liked": true,
    "quotes": []
  },
  "28057276": {
    "body": "Wow. Me too. Can't wait to hear more about it. Sent from my iPhone using Tapatalk",
    "id": 28057276,
    "is_liked": false,
    "quotes": [
      28056481
    ]
  },
  "28052621": {
    "body": "More should follow this evening - been catching up with the real world (aka 'work' !) today ......",
    "id": 28052621,
    "is_liked": false,
    "quotes": [
      28050567
    ]
  },
  "28054226": {
    "body": "Mellendijk Motor Parts.",
    "id": 28054226,
    "is_liked": false,
    "quotes": [
      28053792
    ]
  },
  "28088727": {
    "body": "The first 701 is in at my local dealer ! Checking it out this thursday. (it's the supermoto though)",
    "id": 28088727,
    "is_liked": false,
    "quotes": []
  },
  "28084899": {
    "body": "I wonder what all the naysayers will have to say if in 2017, 690 enduro will disappear and the 701 will get the new Duke 2016 amazing engine, or if both 701 and 690 will get that power plant and the 690 will get the 701 new frame. On the second scenario, that means KTM will be Husky, because will share it's frame? I also don't get all this negativity towards KTM, in the end. Both KTM and Husky are part of the same group. An even better example than the Lexus/Toyota would be the VW Group. If Audi A4 for example, Passat and Octavia are the same cars in someone's mind then yes 690=701. IMHO they are not, although they have plenty more common parts than 701 has with 690 keeping the proportions. More details on that new engine and some pretty fine details about possible frame clearance and compatibility only with the 701 in this post: http://advrider.com/index.php?threads/ktm-690-adventure-re-build.1016239/page-25#post-28066219",
    "id": 28084899,
    "is_liked": true,
    "quotes": []
  },
  "28084678": {
    "body": "... it's time that someone makes a detailed test drive and tell us whether 701 feels like 690.",
    "id": 28084678,
    "is_liked": true,
    "quotes": []
  },
  "28055517": {
    "body": "Probably better than the UK press, most of which have never ridden off road and give such bikes poor reviews.",
    "id": 28055517,
    "is_liked": false,
    "quotes": []
  },
  "28093125": {
    "body": "Some interesting stuff!",
    "id": 28093125,
    "is_liked": false,
    "quotes": []
  },
  "28056299": {
    "body": "I believe the Dirt Bike magazine editor means the total quantity of fuel the bike will hold with the extra tanks.",
    "id": 28056299,
    "is_liked": true,
    "quotes": []
  },
  "28057049": {
    "body": "That would explain those welded bosses on the head tube... build that thing and take my money.",
    "id": 28057049,
    "is_liked": false,
    "quotes": []
  },
  "28054929": {
    "body": "Keep an eye on the Dutch motorcycle press and online reports - I was chatting to a couple of Dutch journalists and they rode both the Enduro and SM models recently and were full of praise for them. Reports should be out soon ..............",
    "id": 28054929,
    "is_liked": true,
    "quotes": [
      28053511
    ]
  },
  "28084211": {
    "body": "Husky's, Husabergs and KTM's may share most of the same component parts, but subtle changes can make a huge difference. These two gentlemen share over 99.8% of the same DNA and yet one of them had perhaps the worlds greatest mind. The other has fluff stuck to his head because it's made of toffee",
    "id": 28084211,
    "is_liked": true,
    "quotes": []
  },
  "28054241": {
    "body": "Thanx!",
    "id": 28054241,
    "is_liked": false,
    "quotes": []
  }
}